duxinglang-1/nRF9160_test/E2_V3_PPG_TEST/src/ppg/max32674.c
static void ppg_polling_timerout(struct k_timer *timer_id);
K_TIMER_DEFINE(ppg_polling_timer, ppg_polling_timerout, NULL);

#if 1
//xb test 20220629
#define POLL_PERIOD_40MS       (0x1)

#define SS_OP_MODE_CONT_WHRM_CONT_SPO2     0x0
#define SS_OP_MODE_CONT_WHRM_ONE_SPO2      0x1
#define SS_OP_MODE_CONT_WHRM               0x2
#define SS_OP_MODE_SAMPLE_WHRM             0x3
#define SS_OP_MODE_SAMPLE_WHRM_ONE_SPO2    0x4
#define SS_OP_MODE_ACTIVITY_TARCK          0x5
#define SS_OP_MODE_SPO2_CALIB              0x6


static uint8_t sh_data_buf[READ_SAMPLE_COUNT_MAX * SS_EXTEND_PACKAGE_SIZE + 1];
sh_read_fifo_callback  gf_fifo_callback  = NULL;
uint32_t gu32_RxSampleSize = 0 ;

//only for test
//in real application, caibVector is used subject by subject
uint8_t gu8_Bpt_calibVector[CAL_RESULT_SIZE] = {
		79, 60, 52, 1, 231, 8, 2, 0, 119, 0, 0, 0, 74, 0, 0, 0,
		0, 0, 0, 0, 83, 243, 173, 60, 0, 0, 128, 66, 242, 25, 117, 63,
		11, 106, 238, 186, 74, 42, 157, 61, 88, 133, 115, 62, 150, 159, 222, 62,
		179, 233, 28, 63, 212, 206, 62, 63, 154, 152, 83, 63, 220, 152, 94, 63,
		181, 76, 101, 63, 71, 1, 109, 63, 157, 16, 117, 63, 199, 113, 123, 63,
		201, 35, 125, 63, 144, 208, 121, 63, 250, 106, 114, 63, 188, 44, 106, 63,
		65, 241, 98, 63, 236, 185, 92, 63, 74, 166, 89, 63, 45, 65, 88, 63,
		164, 242, 86, 63, 244, 109, 82, 63, 143, 52, 76, 63, 230, 177, 68, 63,
		34, 109, 61, 63, 133, 52, 53, 63, 189, 154, 43, 63, 76, 206, 33, 63,
		251, 14, 26, 63, 73, 191, 19, 63, 42, 24, 13, 63, 207, 170, 5, 63,
		193, 7, 254, 62, 255, 15, 241, 62, 245, 182, 226, 62, 220, 17, 209, 62,
		136, 156, 195, 62, 95, 165, 183, 62, 132, 126, 168, 62, 54, 32, 152, 62,
		203, 216, 136, 62, 107, 120, 116, 62, 50, 66, 93, 62, 62, 0, 70, 62,
		99, 89, 36, 62, 183, 133, 241, 61, 122, 40, 166, 61, 93, 222, 63, 61,
		65, 134, 19, 60, 255, 95, 222, 188, 0, 0, 0, 0, 77, 77, 77, 77
};

//Was only mode, HR + SPO2
void sh_HR_SPO2_mode_Fifo_cb(uint32_t u32_sampleCnt, uint32_t u32_sampleSize, uint8_t* u8_data_buf);
sshub_ctrl_params_t  sh_ctrl_HR_SPO2_param = {
	.biometricOpMode             = SH_OPERATION_WHRM_MODE,                   //HR+SPO2 only , no BPT
	.algoWasOperatingMode        = SS_OP_MODE_CONT_WHRM_CONT_SPO2,           //continuously HR and continuously SPO2
	.algoWasRptMode              = SENSORHUB_MODE_BASIC,                     //basic output for WAS
	.FifoDataType                = SS_DATATYPE_BOTH | SS_DATATYPE_CNT_MSK,
	.reportPeriod_in40msSteps    = POLL_PERIOD_40MS * 1,
	.tmrPeriod_ms                = POLL_PERIOD_40MS * 1 * 40,
	.FifoSampleSize              = SS_NORMAL_PACKAGE_SIZE,
	.AccelType                   = SH_INPUT_DATA_DIRECT_SENSOR,
	.sh_fn_cb                    = sh_HR_SPO2_mode_Fifo_cb,
};

void sh_BPT_Calib_mode_cb(uint32_t u32_sampleCnt, uint32_t u32_sampleSize, uint8_t* u8_data_buf);
sshub_ctrl_params_t  sh_ctrl_WAS_BPT_CALIB_param = {
	.biometricOpMode             = SH_OPERATION_WHRM_BPT_MODE,               //HR+SPO2+BPT
	.algoWasOperatingMode        = SS_OP_MODE_CONT_WHRM_CONT_SPO2,           //continuously HR and continuously SPO2
	.algoWasRptMode              = SENSORHUB_MODE_BASIC,                     //basic output for WAS
	.algoBptMode                 = BPT_ALGO_MODE_CALIBRATION,                //BPT calibration mode
	.FifoDataType                = SS_DATATYPE_BOTH | SS_DATATYPE_CNT_MSK,
	.reportPeriod_in40msSteps    = POLL_PERIOD_40MS *10 * 4,
	.tmrPeriod_ms                = POLL_PERIOD_40MS * 10,
	.FifoSampleSize              = SS_NORMAL_PACKAGE_SIZE + SSBPT_ALGO_DATASIZE,
	.AccelType                   = SH_INPUT_DATA_DIRECT_SENSOR,
	.bpt_ref_syst                = 119,
	.bpt_ref_dias                = 74,
	.sh_fn_cb                    = sh_BPT_Calib_mode_cb,
};

void sh_BPT_Est_mode_cb(uint32_t u32_sampleCnt, uint32_t u32_sampleSize, uint8_t* u8_data_buf);
sshub_ctrl_params_t  sh_ctrl_WAS_BPT_EST_param = {
	.biometricOpMode             = SH_OPERATION_WHRM_BPT_MODE,               //HR+SPO2+BPT
	.algoWasOperatingMode        = SS_OP_MODE_CONT_WHRM_CONT_SPO2,           //continuously HR and continuously SPO2
	.algoWasRptMode              = SENSORHUB_MODE_BASIC,                     //basic output for WAS
	.algoBptMode                 = BPT_ALGO_MODE_ESTIMATION,                 //BPT estimation mode
	.FifoDataType                = SS_DATATYPE_BOTH | SS_DATATYPE_CNT_MSK,
	.reportPeriod_in40msSteps    = POLL_PERIOD_40MS * 10 * 4,
	.tmrPeriod_ms                = POLL_PERIOD_40MS * 10,
	.FifoSampleSize              = SS_NORMAL_PACKAGE_SIZE + SSBPT_ALGO_DATASIZE,
	.AccelType                   = SH_INPUT_DATA_DIRECT_SENSOR,
	.sh_fn_cb                    = sh_BPT_Est_mode_cb,
};


void sh_rawdata_cb(uint32_t u32_sampleCnt, uint32_t u32_sampleSize, uint8_t* u8_data_buf);
sshub_ctrl_params_t  sh_ctrl_rawdata_param = {
	.biometricOpMode             = SH_OPERATION_RAW_MODE,                	 //raw data
	.algoWasRptMode              = SENSORHUB_MODE_BASIC,                     //basic output for WAS
	.FifoDataType                = SS_DATATYPE_RAW | SS_DATATYPE_CNT_MSK,
	.reportPeriod_in40msSteps    = POLL_PERIOD_40MS,
	.tmrPeriod_ms                = POLL_PERIOD_40MS * 40,
	.FifoSampleSize              = SS_PACKET_COUNTERSIZE + SSMAX86176_MODE1_DATASIZE,
	.AccelType                   = SH_INPUT_DATA_DIRECT_SENSOR,
	.sh_fn_cb                    = sh_rawdata_cb,
};


void sh_ecg_cb(uint32_t u32_sampleCnt, uint32_t u32_sampleSize, uint8_t* u8_data_buf);
sshub_ctrl_params_t  sh_ctrl_ecg_param = {
	.biometricOpMode             = SH_OPERATION_RAW_MODE,                    //raw data
	.algoWasRptMode              = SENSORHUB_MODE_BASIC,                     //basic output for WAS
	.FifoDataType                = SS_DATATYPE_RAW | SS_DATATYPE_CNT_MSK,
	.reportPeriod_in40msSteps    = POLL_PERIOD_40MS,
	.tmrPeriod_ms                = POLL_PERIOD_40MS * 40,
	.FifoSampleSize              = SS_PACKET_COUNTERSIZE + SSRAW_ECG_DATASIZE,
	.sh_fn_cb                    = sh_ecg_cb,
};

static void demoLogAllData(uint8_t u8_sampleIndex, sensorhub_output *sh_output)
{
#if 1//def PPG_DEBUG
	LOGD("%d, %d,%d,%d,  %d,%d,%d,%d,%d,%d,    %d,%d, %d,%d,%d,%d,  %d,%d,%d, %d,%d,%d,%d,%d, %d",

			u8_sampleIndex,

			sh_output->acc_data.x,
			sh_output->acc_data.y,
			sh_output->acc_data.z,

			sh_output->ppg_data.led1,
			sh_output->ppg_data.led2,
			sh_output->ppg_data.led3,
			sh_output->ppg_data.led4,
			sh_output->ppg_data.led5,
			sh_output->ppg_data.led6,

			sh_output->algo_data.hr,
			sh_output->algo_data.hr_conf,

