duxinglang-1/nRF9160_test/E2_V3_PPG_TEST/src/ppg/max32674.c
			sh_output->algo_data.rr,
			sh_output->algo_data.rr_conf,
			sh_output->algo_data.activity_class,
			sh_output->algo_data.r,

			sh_output->algo_data.spo2_conf,
			sh_output->algo_data.spo2,
			sh_output->algo_data.percentComplete,

			sh_output->algo_data.lowSignalQualityFlag,
			sh_output->algo_data.motionFlag,
			sh_output->algo_data.lowPiFlag,
			sh_output->algo_data.unreliableRFlag,
			sh_output->algo_data.spo2State,

			sh_output->algo_data.scd_contact_state
			);
#endif
}

void demoLogPPGRawData(uint8_t u8_sampleIndex, sensorhub_output *sh_output)
{
#ifdef PPG_DEBUG
	LOGD("%d,  %d,%d,%d,%d,%d,%d",
			u8_sampleIndex,
			sh_output->ppg_data.led1,
			sh_output->ppg_data.led2,
			sh_output->ppg_data.led3,
			sh_output->ppg_data.led4,
			sh_output->ppg_data.led5,
			sh_output->ppg_data.led6
			);
#endif
}

static void sh_loadFifoParam(sshub_ctrl_params_t* sh_param)
{
	gu32_RxSampleSize = sh_param->FifoSampleSize;
	if (sh_param->sh_fn_cb != NULL)
	{
		gf_fifo_callback  = sh_param->sh_fn_cb;
	}
}

int32_t sh_enter_app_mode(void* param)
{
	sh_reset_to_main_app();
	sh_get_hub_fw_version();
	return 0;
}

int32_t sh_enter_bl_mode(void* param)
{
	sh_reset_to_bootloader();
	sh_get_hub_fw_version();
	return 0;
}

int32_t sh_disable_sensor(void* param)
{
	sh_stop_polling_timer();
	sensorhub_disable_sensor();

	gf_fifo_callback = NULL;

	return 0;
}

void sh_HR_SPO2_mode_Fifo_cb(uint32_t u32_sampleCnt, uint32_t u32_sampleSize, uint8_t* u8_data_buf)
{
	sensorhub_output sensorhub_out;
	uint8_t* u8_fifo_buf = (uint8_t*)u8_data_buf;
	memset(&sensorhub_out, 0, sizeof(sensorhub_output));

	uint32_t u32_idx = 0;
	for (int i= 0; i < u32_sampleCnt; i++)
	{
		u32_idx = i * u32_sampleSize  + 1;

		accel_data_rx(&sensorhub_out.acc_data, &u8_fifo_buf[ u32_idx + SS_PACKET_COUNTERSIZE]);
		max86176_data_rx(&sensorhub_out.ppg_data, &u8_fifo_buf[u32_idx+ SS_PACKET_COUNTERSIZE + SSACCEL_MODE1_DATASIZE]);
		whrm_wspo2_suite_data_rx_mode1(&sensorhub_out.algo_data, &u8_fifo_buf[u32_idx + SS_PACKET_COUNTERSIZE +
																		  SSMAX86176_MODE1_DATASIZE + SSACCEL_MODE1_DATASIZE] );

		demoLogAllData(u8_fifo_buf[u32_idx], &sensorhub_out);

	}
}

int32_t sh_start_HR_SPO2_mode(void* param)
{
	int status = -1;
	sshub_ctrl_params_t* sh_param = (sshub_ctrl_params_t*)param;

	//10 01 01
	status = sh_set_fifo_thresh(1);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_fifo_thresh eorr %d", status);
	#endif
		return -1;
	}

	//10 02 01
	status = sh_set_report_period(sh_param->reportPeriod_in40msSteps);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_report_period eorr %d", status);
	#endif
		return -1;
	}

	//enabled AEC: 50 08 0B 01
	status = sh_set_cfg_wearablesuite_afeenable(1);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("enable AEC eorr %d", status);
	#endif
		return -1;
	}

	//enable auto pd current: 50 08 12 01
	status = sh_set_cfg_wearablesuite_autopdcurrentenable(0x1);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("enable auto PD current eorr %d", status);
	#endif
		return -1;
	}

	//set output format: 10 00 07
	///TODO:clean up output type
	status = sh_set_data_type(sh_param->FifoDataType, true);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_data_type eorr %d", status);
	#endif
		return -1;
	}

	//44 04 01 00
	status = sh_sensor_enable_(SH_SENSORIDX_ACCEL, 1, sh_param->AccelType);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_sensor_enable_ACC eorr %d", status);
	#endif
		return -1;
	}

	//AA 44 06 01 00
	status = sh_sensor_enable_(SH_SENSORIDX_MAX86176, 1, 0);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_sensor_enable_MAX86176 eorr %d", status);
	#endif
		return -1;
	}

	//set WAS only ,no BPT
	//50 08 40 01
	status = sensorhub_set_algo_operation_mode(sh_param->biometricOpMode);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("set biometric mode eorr %d", status);
	#endif
		return -1;
	}

	//set algorithm operation mode
	//50 08 0A 00
	status = sh_set_cfg_wearablesuite_algomode(sh_param->algoWasOperatingMode);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_cfg_wearablesuite_algomode eorr %d", status);
	#endif
		return -1;
	}

	//set to basic output mode and enable algo
	//AA 52 08 01
	status = sh_enable_algo_(SS_ALGOIDX_WHRM_WSPO2_SUITE_OS6X ,sh_param->algoWasRptMode);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_enable_algo_ eorr %d", status);
	#endif
		return -1;
	}

	//set fifo callback function
	sh_loadFifoParam(sh_param);

	///TODO: set timer based on setting report rate
	sh_start_polling_timer(sh_param->tmrPeriod_ms);

	return 0;
}

void sh_BPT_Calib_mode_cb(uint32_t u32_sampleCnt, uint32_t u32_sampleSize, uint8_t* u8_data_buf)
{
	uint8_t* u8_fifo_buf = (uint8_t*)u8_data_buf;
#if 0
	uint8_t u8_idx = 1;
	for (int i= 0; i < u32_sampleCnt; i++)
	{
		for (int x = 0; x < u32_sampleSize; x ++)
		{
			printf("%x,", u8_fifo_buf[u8_idx+x]);
		}

		u8_idx += u32_sampleSize;
		printf("\n");
	}
#endif
	uint8_t Bpt_status = u8_fifo_buf[SS_NORMAL_PACKAGE_SIZE +1];
	uint8_t calib_progress = u8_fifo_buf[SS_NORMAL_PACKAGE_SIZE +1 + 1];

#ifdef PPG_DEBUG
	LOGD("BPT status is %d, calib prgoress is %d", Bpt_status, calib_progress);
#endif
	if ((Bpt_status == 2 ) && (calib_progress = 100))
	{
		sh_get_cfg_bpt_cal_result(gu8_Bpt_calibVector);
		sh_stop_polling_timer();
		sensorhub_disable_sensor();
	}
}

void sh_BPT_Est_mode_cb(uint32_t u32_sampleCnt, uint32_t u32_sampleSize, uint8_t* u8_data_buf)
{
	uint8_t* u8_fifo_buf = (uint8_t*)u8_data_buf;
#if 1
	uint8_t u8_idx = 1;
	for (int i= 0; i < u32_sampleCnt; i++)
	{
		for (int x = 0; x < u32_sampleSize; x ++)
		{
		#ifdef PPG_DEBUG
			LOGD("%x,", u8_fifo_buf[u8_idx+x]);
		#endif
		}

		u8_idx += u32_sampleSize;
	}
#endif
}

//HR + SPO2 + BPT mode
int32_t sh_start_WAS_BPT_mode(void* param)
{
	int status = -1;
	sshub_ctrl_params_t* sh_param = (sshub_ctrl_params_t*)param;

	if (sh_param->algoBptMode == BPT_ALGO_MODE_CALIBRATION)
	{
		//50 08 62 00 75 4C
		status = sh_set_cfg_bpt_sys_dia(0x00, sh_param->bpt_ref_syst, sh_param->bpt_ref_dias);
		if (status != SS_SUCCESS)
		{		
		#ifdef PPG_DEBUG
			LOGD("sh_set_cfg_bpt_sys_dia eorr %d", status);
		#endif
			return -1;
		}
		else
		{		
		#ifdef PPG_DEBUG
			LOGD("Set reference BP value done");
		#endif
		}
	}
	else if (sh_param->algoBptMode == BPT_ALGO_MODE_ESTIMATION)
	{
		status = sh_set_cfg_bpt_cal_index(0x0);
		if (status != SS_SUCCESS)
		{		
		#ifdef PPG_DEBUG
			LOGD("sh_set_cfg_bpt_cal_index eorr %d", status);
		#endif
			return -1;
		}

		status = sh_set_cfg_bpt_cal_result(gu8_Bpt_calibVector);
		if (status != SS_SUCCESS)
		{		
		#ifdef PPG_DEBUG
			LOGD("sh_set_cfg_bpt_cal_result eorr %d", status);
		#endif
			return -1;
		}
		else
		{		
		#ifdef PPG_DEBUG
			LOGD("set user BP vector done");
		#endif
		}
	}

	//10 01 01
	status = sh_set_fifo_thresh(1);
	if (status != SS_SUCCESS)
	{	
	#ifdef PPG_DEBUG
		LOGD("sh_set_fifo_thresh eorr %d", status);
	#endif
		return -1;
	}

	//10 02 01
	status = sh_set_report_period(sh_param->reportPeriod_in40msSteps);  //1Hz or 25Hz
	if (status != SS_SUCCESS)
	{	
	#ifdef PPG_DEBUG
		LOGD("sh_set_report_period eorr %d", status);
	#endif
		return -1;
	}

	//enabled AEC: 50 08 0B 01
	status = sh_set_cfg_wearablesuite_afeenable(1);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("enable AEC eorr %d", status);
	#endif
		return -1;
	}

