duxinglang-1/nRF9160_test/E2_V3_PPG_TEST/src/ppg/max32674.c
	//enable auto pd current: 50 08 12 01
	status = sh_set_cfg_wearablesuite_autopdcurrentenable(0x1);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("enable auto PD current eorr %d", status);
	#endif
		return -1;
	}

	//set output format: 10 00 07
	///TODO:clean up output type
	status = sh_set_data_type(sh_param->FifoDataType, true);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_data_type eorr %d", status);
	#endif
		return -1;
	}

	//44 04 01 00
	status = sh_sensor_enable_(SH_SENSORIDX_ACCEL, 1, sh_param->AccelType);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_sensor_enable_ACC eorr %d", status);
	#endif
		return -1;
	}

	//AA 44 06 01 00
	status = sh_sensor_enable_(SH_SENSORIDX_MAX86176, 1, SH_INPUT_DATA_DIRECT_SENSOR);
	if (status != SS_SUCCESS)
	{	
	#ifdef PPG_DEBUG
		LOGD("sh_sensor_enable_MAX86176 eorr %d", status);
	#endif
		return -1;
	}

	//set WAS + BPT
	//50 08 40 03
	sensorhub_set_algo_operation_mode(sh_param->biometricOpMode);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sensorhub_set_algo_operation_mode eorr %d", status);
	#endif
		return -1;
	}

	//set algorithm operation mode
	//50 08 0A 00
	status = sh_set_cfg_wearablesuite_algomode(sh_param->algoWasOperatingMode);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_cfg_wearablesuite_algomode eorr %d", status);
	#endif
		return -1;
	}

	//set bpt calibration mode
	status = sensorhub_set_bpt_algo_submode(sh_param->algoBptMode);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sensorhub_set_bpt_algo_submode eorr %d", status);
	#endif
		return -1;
	}

	//set to basic output mode and enable algo
	//AA 52 08 01
	status = sh_enable_algo_(SS_ALGOIDX_WHRM_WSPO2_SUITE_OS6X , sh_param->algoWasRptMode);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_sensor_enable_MAX86176 eorr %d", status);
	#endif
		return -1;
	}

	//set fifo callback function
	sh_loadFifoParam(sh_param);

	///TODO: set timer based on setting report rate
	sh_start_polling_timer(40);

	return 0;
}

void sh_rawdata_cb(uint32_t u32_sampleCnt, uint32_t u32_sampleSize, uint8_t* u8_data_buf)
{
	sensorhub_output sensorhub_out;
	uint8_t* u8_fifo_buf = (uint8_t*)u8_data_buf;

	uint32_t u32_idx = 1;
	for (int i= 0; i < u32_sampleCnt; i++)
	{
		//accel_data_rx(&sensorhub_out.acc_data, &u8_fifo_buf[ u32_idx + SS_PACKET_COUNTERSIZE]);
		max86176_data_rx(&sensorhub_out.ppg_data, &u8_fifo_buf[u32_idx+ SS_PACKET_COUNTERSIZE]);
		demoLogPPGRawData(u8_fifo_buf[u32_idx], &sensorhub_out);

		u32_idx += u32_sampleSize;
	}
}

int32_t sh_start_rawdata_mode(void* param)
{
	int status = -1;
	sshub_ctrl_params_t* sh_param = (sshub_ctrl_params_t*)param;

	//10 01 01
	status = sh_set_fifo_thresh(1);
	if (status != SS_SUCCESS)
	{	
	#ifdef PPG_DEBUG
		LOGD("sh_set_fifo_thresh eorr %d", status);
	#endif
		return -1;
	}

	//10 02 01
	status = sh_set_report_period(sh_param->reportPeriod_in40msSteps);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_report_period eorr %d", status);
	#endif
		return -1;
	}

	//set output format: 10 00 07
	//TODO:clean up output type
	status = sh_set_data_type(sh_param->FifoDataType, true);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_data_type eorr %d", status);
	#endif
		return -1;
	}

#if 0
	//44 04 01 00
	status = sh_sensor_enable_(SH_SENSORIDX_ACCEL, 1, sh_param->AccelType);
	if (status != SS_SUCCESS)
	{
		printf("sh_sensor_enable_ACC eorr %d \n", status);
		return -1;
	}
#endif

	//AA 44 06 01 00
	status = sh_sensor_enable_(SH_SENSORIDX_MAX86176, 1, 0);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_sensor_enable_MAX86176 eorr %d", status);
	#endif
		return -1;
	}

	//set rawdata only mode
	//50 08 40 00
	status = sensorhub_set_algo_operation_mode(sh_param->biometricOpMode);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("set biometric mode eorr %d", status);
	#endif
		return -1;
	}

	//set to basic output mode and enable algo
	//AA 52 08 01
	status = sh_enable_algo_(SS_ALGOIDX_WHRM_WSPO2_SUITE_OS6X ,sh_param->algoWasRptMode);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_enable_algo_ eorr %d", status);
	#endif
		return -1;
	}

	status = sh_set_cfg_wearablesuite_initledcurr(0, 0x0064);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("ah_set_cfg_wearablesuite_initledcurr 0 eorr %d", status);
	#endif
		return -1;
	}

	//LED current
	//status = sh_set_cfg_wearablesuite_initledcurr(1, 0x00cf);
	status = sh_set_reg(SH_SENSORIDX_MAX86176, 0x25, PPG_LED_G_CUR, 1);//green
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_reg led green curr eorr %d", status);
	#endif
		return -1;
	}
	//status = sh_set_cfg_wearablesuite_initledcurr(2, 0x00cf);
	status = sh_set_reg(SH_SENSORIDX_MAX86176, 0x2d, PPG_LED_IR_CUR, 1);//IR
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_reg led IR curr eorr %d", status);
	#endif
		return -1;
	}
	//status = sh_set_cfg_wearablesuite_initledcurr(3, 0x00cf);
	status = sh_set_reg(SH_SENSORIDX_MAX86176, 0x35, PPG_LED_R_CUR, 1);//red
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_reg led red curr eorr %d", status);
	#endif
		return -1;
	}

	//LED Tint
	status = sh_set_reg(SH_SENSORIDX_MAX86176, 0x21, 0x18, 1);//green
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_reg led green Tint eorr %d", status);
	#endif
		return -1;
	}
	//status = sh_set_cfg_wearablesuite_initledcurr(2, 0x00cf);
	status = sh_set_reg(SH_SENSORIDX_MAX86176, 0x29, 0x18, 1);//IR
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_reg led IR Tint eorr %d", status);
	#endif
		return -1;
	}
	//status = sh_set_cfg_wearablesuite_initledcurr(3, 0x00cf);
	status = sh_set_reg(SH_SENSORIDX_MAX86176, 0x31, 0x18, 1);//red
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_reg led red Tint eorr %d", status);
	#endif
		return -1;
	}

	//ADC range
	status = sh_set_reg(SH_SENSORIDX_MAX86176, 0x22, PPG_LED_G_ADC_RANGE, 1);//0x30 0x3f
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_reg led green adc eorr %d", status);
	#endif
		return -1;
	}
	status = sh_set_reg(SH_SENSORIDX_MAX86176, 0x2a, PPG_LED_IR_ADC_RANGE, 1);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_reg led IR adc eorr %d", status);
	#endif
		return -1;
	}
	status = sh_set_reg(SH_SENSORIDX_MAX86176, 0x32, PPG_LED_R_ADC_RANGE, 1);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_reg led red adc eorr %d", status);
	#endif
		return -1;
	}

	//sps
	//set fifo callback function
	sh_loadFifoParam(sh_param);

	//TODO: set timer based on setting report rate
	sh_start_polling_timer(sh_param->tmrPeriod_ms);

