duxinglang-1/nRF9160_test/E2_V3_PPG_TEST/src/ppg/max32674.c
	return 0;
}

void sh_ecg_cb(uint32_t u32_sampleCnt, uint32_t u32_sampleSize, uint8_t* u8_data_buf)
{
	uint8_t* u8_fifo_buf = (uint8_t*)u8_data_buf;
	uint8_t u8_idx = 1;
	uint32_t u32_EcgSample;

	//divide every 48 bytes
	for (int i= 0; i < u32_sampleCnt; i++)
	{
		//printf("----------counter = %d \n,", u8_fifo_buf[u8_idx]);
		u8_idx = u8_idx +1;    //first byte is fifo counter

		//divide 16 ecg samples
		for (int x = 0; x < 16; x ++)
		{
			u32_EcgSample  = u8_fifo_buf[u8_idx]<<16;
			u32_EcgSample += u8_fifo_buf[u8_idx+1]<<8;
			u32_EcgSample += u8_fifo_buf[u8_idx+2];
			u32_EcgSample  = u32_EcgSample & 0xFFFFF;   // ECG[0:19], ECG_TAG[20:23]
			u8_idx = u8_idx +3;
		
		#ifdef PPG_DEBUG
			LOGD("%d", u32_EcgSample);
		#endif
		}
	}
}

int32_t sh_start_ecg_mode(void* param)
{
	int status = -1;
	sshub_ctrl_params_t* sh_param = (sshub_ctrl_params_t*)param;

	//10 01 01
	status = sh_set_fifo_thresh(1);
	if (status != SS_SUCCESS)
	{	
	#ifdef PPG_DEBUG
		LOGD("sh_set_fifo_thresh eorr %d", status);
	#endif
		return -1;
	}

	//10 02 01
	status = sh_set_report_period(sh_param->reportPeriod_in40msSteps);
	if (status != SS_SUCCESS)
	{	
	#ifdef PPG_DEBUG
		LOGD("sh_set_report_period eorr %d", status);
	#endif
		return -1;
	}

	//set output format: 10 00 07
	///TODO:clean up output type
	status = sh_set_data_type(sh_param->FifoDataType, true);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_set_data_type eorr %d", status);
	#endif
		return -1;
	}

	//AA 44 06 02 00
	status = sh_sensor_enable_(SH_SENSORIDX_MAX86176, 0x2, 0);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_sensor_enable_MAX86176 eorr %d", status);
	#endif
		return -1;
	}

	//set rawdata only mode
	//50 08 40 00
	status = sensorhub_set_algo_operation_mode(sh_param->biometricOpMode);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("set biometric mode eorr %d", status);
	#endif
		return -1;
	}

	//set to basic output mode and enable algo
	//AA 52 08 01
	status = sh_enable_algo_(SS_ALGOIDX_WHRM_WSPO2_SUITE_OS6X ,sh_param->algoWasRptMode);
	if (status != SS_SUCCESS)
	{
	#ifdef PPG_DEBUG
		LOGD("sh_enable_algo_ eorr %d", status);
	#endif
		return -1;
	}

	//set fifo callback function
	sh_loadFifoParam(sh_param);

	///TODO: set timer based on setting report rate
	sh_start_polling_timer(sh_param->tmrPeriod_ms);

	return 0;
}

//timer callback function, poling sensor hub FIFO
void sh_FIFO_polling_handler(void)
{
	uint32_t ret = 0;
	uint8_t hubStatus = 0;
	int u32_sampleCnt = 0;

	ret = sh_get_sensorhub_status(&hubStatus);
#ifdef PPG_DEBUG
	//LOGD("sh_get_sensorhub_status ret = %d, hubStatus =  %d", ret, hubStatus);
#endif	
	if ((0 == ret) && (hubStatus & SS_MASK_STATUS_DATA_RDY))
	{
	#ifdef PPG_DEBUG
		//LOGD("FIFO status is ready");
	#endif
		ret = sensorhub_get_output_sample_number(&u32_sampleCnt);
	#if 0
		if (ret ==  SS_SUCCESS)
			printf("sample count is %d \n", u32_sampleCnt);
	#endif

		//limit the maximum counter to prevent reading fifo overflow
		u32_sampleCnt = (u32_sampleCnt > READ_SAMPLE_COUNT_MAX) ? READ_SAMPLE_COUNT_MAX :  u32_sampleCnt;
		//read fifo data, sample size must be loaded before FIFO reading by sh_loadFifoParam()
		ret = sh_read_fifo_data(u32_sampleCnt, gu32_RxSampleSize, sh_data_buf, sizeof(sh_data_buf));

		if (ret ==  SS_SUCCESS)
		{
			//process fifo data
			if (gf_fifo_callback != NULL)
			{
				gf_fifo_callback(u32_sampleCnt, gu32_RxSampleSize, sh_data_buf);
			}
		}
		else
		{
		#ifdef PPG_DEBUG
			//LOGD("read FIFO result fail %d", ret);
		#endif
		}
	}
	else
	{
	#ifdef PPG_DEBUG
		//LOGD("FIFO status is not ready  %d, %d", ret, hubStatus);
	#endif
	}
}
#endif
//xb end 2022.06.29

void ClearAllBptRecData(void)
{
	uint8_t tmpbuf[PPG_BPT_REC2_DATA_SIZE] = {0xff};

	memset(&g_bpt, 0, sizeof(bpt_data));
	memset(&g_bpt_menu, 0, sizeof(bpt_data));	
	
	SpiFlash_Write(tmpbuf, PPG_BPT_REC2_DATA_ADDR, PPG_BPT_REC2_DATA_SIZE);
}

void SetCurDayBptRecData(bpt_data bpt)
{
	uint8_t i,tmpbuf[PPG_BPT_REC2_DATA_SIZE] = {0};
	ppg_bpt_rec2_data *p_bpt,tmp_bpt = {0};
	sys_date_timer_t temp_date = {0};

	//It is saved before the hour, but recorded as the hour data, so hour needs to be increased by 1
	memcpy(&temp_date, &date_time, sizeof(sys_date_timer_t));
	TimeIncrease(&temp_date, 60);
	
	tmp_bpt.year = temp_date.year;
	tmp_bpt.month = temp_date.month;
	tmp_bpt.day = temp_date.day;
	memcpy(&tmp_bpt.bpt[temp_date.hour], &bpt, sizeof(bpt_data));
	
	SpiFlash_Read(tmpbuf, PPG_BPT_REC2_DATA_ADDR, PPG_BPT_REC2_DATA_SIZE);
	p_bpt = tmpbuf;
	if((p_bpt->year == 0xffff || p_bpt->year == 0x0000)
		||(p_bpt->month == 0xff || p_bpt->month == 0x00)
		||(p_bpt->day == 0xff || p_bpt->day == 0x00)
		||((p_bpt->year == temp_date.year)&&(p_bpt->month == temp_date.month)&&(p_bpt->day == temp_date.day))
		)
	{
		//直接覆盖写在第一条
		p_bpt->year = temp_date.year;
		p_bpt->month = temp_date.month;
		p_bpt->day = temp_date.day;
		memcpy(&p_bpt->bpt[temp_date.hour], &bpt, sizeof(bpt_data));
		SpiFlash_Write(tmpbuf, PPG_BPT_REC2_DATA_ADDR, PPG_BPT_REC2_DATA_SIZE);
	}
	else if((temp_date.year < p_bpt->year)
			||((temp_date.year == p_bpt->year)&&(temp_date.month < p_bpt->month))
			||((temp_date.year == p_bpt->year)&&(temp_date.month == p_bpt->month)&&(temp_date.day < p_bpt->day))
			)
	{
		uint8_t databuf[PPG_BPT_REC2_DATA_SIZE] = {0};
		
		//插入新的第一条,旧的第一条到第六条往后挪，丢掉最后一个
		memcpy(&databuf[0*sizeof(ppg_bpt_rec2_data)], &tmp_bpt, sizeof(ppg_bpt_rec2_data));
		memcpy(&databuf[1*sizeof(ppg_bpt_rec2_data)], &tmpbuf[0*sizeof(ppg_bpt_rec2_data)], 6*sizeof(ppg_bpt_rec2_data));
		SpiFlash_Write(databuf, PPG_BPT_REC2_DATA_ADDR, PPG_BPT_REC2_DATA_SIZE);
	}
	else
	{
		uint8_t databuf[PPG_BPT_REC2_DATA_SIZE] = {0};
		
		//寻找合适的插入位置
		for(i=0;i<7;i++)
		{
			p_bpt = tmpbuf+i*sizeof(ppg_bpt_rec2_data);
			if((p_bpt->year == 0xffff || p_bpt->year == 0x0000)
				||(p_bpt->month == 0xff || p_bpt->month == 0x00)
				||(p_bpt->day == 0xff || p_bpt->day == 0x00)
				||((p_bpt->year == temp_date.year)&&(p_bpt->month == temp_date.month)&&(p_bpt->day == temp_date.day))
				)
			{
				//直接覆盖写
				p_bpt->year = temp_date.year;
				p_bpt->month = temp_date.month;
				p_bpt->day = temp_date.day;
				memcpy(&p_bpt->bpt[temp_date.hour], &bpt, sizeof(bpt_data));
				SpiFlash_Write(tmpbuf, PPG_BPT_REC2_DATA_ADDR, PPG_BPT_REC2_DATA_SIZE);
				return;
			}
			else if((temp_date.year > p_bpt->year)
				||((temp_date.year == p_bpt->year)&&(temp_date.month > p_bpt->month))
				||((temp_date.year == p_bpt->year)&&(temp_date.month == p_bpt->month)&&(temp_date.day > p_bpt->day))
				)
			{
				if(i < 6)
				{
					p_bpt++;
					if((temp_date.year < p_bpt->year)
						||((temp_date.year == p_bpt->year)&&(temp_date.month < p_bpt->month))
						||((temp_date.year == p_bpt->year)&&(temp_date.month == p_bpt->month)&&(temp_date.day < p_bpt->day))
						)
					{
						break;
					}
				}
			}
		}

		if(i<6)
		{
			//找到位置，插入新数据，老数据整体往后挪，丢掉最后一个
			memcpy(&databuf[0*sizeof(ppg_bpt_rec2_data)], &tmpbuf[0*sizeof(ppg_bpt_rec2_data)], (i+1)*sizeof(ppg_bpt_rec2_data));
			memcpy(&databuf[(i+1)*sizeof(ppg_bpt_rec2_data)], &tmp_bpt, sizeof(ppg_bpt_rec2_data));
			memcpy(&databuf[(i+2)*sizeof(ppg_bpt_rec2_data)], &tmpbuf[(i+1)*sizeof(ppg_bpt_rec2_data)], (7-(i+2))*sizeof(ppg_bpt_rec2_data));
			SpiFlash_Write(databuf, PPG_BPT_REC2_DATA_ADDR, PPG_BPT_REC2_DATA_SIZE);
		}
		else
		{
			//未找到位置，直接接在末尾，老数据整体往前移，丢掉最前一个
			memcpy(&databuf[0*sizeof(ppg_bpt_rec2_data)], &tmpbuf[1*sizeof(ppg_bpt_rec2_data)], 6*sizeof(ppg_bpt_rec2_data));
			memcpy(&databuf[6*sizeof(ppg_bpt_rec2_data)], &tmp_bpt, sizeof(ppg_bpt_rec2_data));
			SpiFlash_Write(databuf, PPG_BPT_REC2_DATA_ADDR, PPG_BPT_REC2_DATA_SIZE);
		}
	}
}

