duxinglang-1/nRF9160_test/E2_V3_PPG_TEST/src/ppg/max32674.c
void GetCurDayBptRecData(uint8_t *databuf)
{
	uint8_t i,tmpbuf[PPG_BPT_REC2_DATA_SIZE] = {0};
	ppg_bpt_rec2_data bpt_rec2 = {0};
	
	if(databuf == NULL)
		return;

	SpiFlash_Read(tmpbuf, PPG_BPT_REC2_DATA_ADDR, PPG_BPT_REC2_DATA_SIZE);
	for(i=0;i<7;i++)
	{
		memcpy(&bpt_rec2, &tmpbuf[i*sizeof(ppg_bpt_rec2_data)], sizeof(ppg_bpt_rec2_data));
		if((bpt_rec2.year == 0xffff || bpt_rec2.year == 0x0000)||(bpt_rec2.month == 0xff || bpt_rec2.month == 0x00)||(bpt_rec2.day == 0xff || bpt_rec2.day == 0x00))
			continue;
		
		if((bpt_rec2.year == date_time.year)&&(bpt_rec2.month == date_time.month)&&(bpt_rec2.day == date_time.day))
		{
			memcpy(databuf, bpt_rec2.bpt, sizeof(bpt_rec2.bpt));
			break;
		}
	}
}

void GetGivenTimeBptRecData(sys_date_timer_t date, bpt_data *bpt)
{
	uint8_t i,tmpbuf[PPG_BPT_REC2_DATA_SIZE] = {0};
	ppg_bpt_rec2_data bpt_rec2 = {0};

	if(!CheckSystemDateTimeIsValid(date))
		return;
	if(bpt == NULL)
		return;

	SpiFlash_Read(tmpbuf, PPG_BPT_REC2_DATA_ADDR, PPG_BPT_REC2_DATA_SIZE);
	for(i=0;i<7;i++)
	{
		memcpy(&bpt_rec2, &tmpbuf[i*sizeof(ppg_bpt_rec2_data)], sizeof(ppg_bpt_rec2_data));
		if((bpt_rec2.year == 0xffff || bpt_rec2.year == 0x0000)||(bpt_rec2.month == 0xff || bpt_rec2.month == 0x00)||(bpt_rec2.day == 0xff || bpt_rec2.day == 0x00))
			continue;
		
		if((bpt_rec2.year == date.year)&&(bpt_rec2.month == date.month)&&(bpt_rec2.day == date.day))
		{
			memcpy(bpt, &bpt_rec2.bpt[date.hour], sizeof(bpt_data));
			break;
		}
	}
}

void ClearAllSpo2RecData(void)
{
	uint8_t tmpbuf[PPG_SPO2_REC2_DATA_SIZE] = {0xff};

	g_spo2 = 0;
	g_spo2_menu = 0;

	SpiFlash_Write(tmpbuf, PPG_SPO2_REC2_DATA_ADDR, PPG_SPO2_REC2_DATA_SIZE);
}

void SetCurDaySpo2RecData(uint8_t spo2)
{
	uint8_t i,tmpbuf[PPG_SPO2_REC2_DATA_SIZE] = {0};
	ppg_spo2_rec2_data *p_spo2,tmp_spo2 = {0};
	sys_date_timer_t temp_date = {0};
	
	//It is saved before the hour, but recorded as the hour data, so hour needs to be increased by 1
	memcpy(&temp_date, &date_time, sizeof(sys_date_timer_t));
	TimeIncrease(&temp_date, 60);

	tmp_spo2.year = temp_date.year;
	tmp_spo2.month = temp_date.month;
	tmp_spo2.day = temp_date.day;
	tmp_spo2.spo2[temp_date.hour] = spo2;

	SpiFlash_Read(tmpbuf, PPG_SPO2_REC2_DATA_ADDR, PPG_SPO2_REC2_DATA_SIZE);
	p_spo2 = tmpbuf;
	if((p_spo2->year == 0xffff || p_spo2->year == 0x0000)
		||(p_spo2->month == 0xff || p_spo2->month == 0x00)
		||(p_spo2->day == 0xff || p_spo2->day == 0x00)
		||((p_spo2->year == temp_date.year)&&(p_spo2->month == temp_date.month)&&(p_spo2->day == temp_date.day))
		)
	{
		//直接覆盖写在第一条
		p_spo2->year = temp_date.year;
		p_spo2->month = temp_date.month;
		p_spo2->day = temp_date.day;
		p_spo2->spo2[temp_date.hour] = spo2;
		SpiFlash_Write(tmpbuf, PPG_SPO2_REC2_DATA_ADDR, PPG_SPO2_REC2_DATA_SIZE);
	}
	else if((temp_date.year < p_spo2->year)
			||((temp_date.year == p_spo2->year)&&(temp_date.month < p_spo2->month))
			||((temp_date.year == p_spo2->year)&&(temp_date.month == p_spo2->month)&&(temp_date.day < p_spo2->day))
			)
	{
		uint8_t databuf[PPG_SPO2_REC2_DATA_SIZE] = {0};
		
		//插入新的第一条,旧的第一条到第六条往后挪，丢掉最后一个
		memcpy(&databuf[0*sizeof(ppg_spo2_rec2_data)], &tmp_spo2, sizeof(ppg_spo2_rec2_data));
		memcpy(&databuf[1*sizeof(ppg_spo2_rec2_data)], &tmpbuf[0*sizeof(ppg_spo2_rec2_data)], 6*sizeof(ppg_spo2_rec2_data));
		SpiFlash_Write(databuf, PPG_SPO2_REC2_DATA_ADDR, PPG_SPO2_REC2_DATA_SIZE);
	}
	else
	{
		uint8_t databuf[PPG_SPO2_REC2_DATA_SIZE] = {0};
		
		//寻找合适的插入位置
		for(i=0;i<7;i++)
		{
			p_spo2 = tmpbuf+i*sizeof(ppg_spo2_rec2_data);
			if((p_spo2->year == 0xffff || p_spo2->year == 0x0000)
				||(p_spo2->month == 0xff || p_spo2->month == 0x00)
				||(p_spo2->day == 0xff || p_spo2->day == 0x00)
				||((p_spo2->year == temp_date.year)&&(p_spo2->month == temp_date.month)&&(p_spo2->day == temp_date.day))
				)
			{
				//直接覆盖写
				p_spo2->year = temp_date.year;
				p_spo2->month = temp_date.month;
				p_spo2->day = temp_date.day;
				p_spo2->spo2[temp_date.hour] = spo2;
				SpiFlash_Write(tmpbuf, PPG_SPO2_REC2_DATA_ADDR, PPG_SPO2_REC2_DATA_SIZE);
				return;
			}
			else if((temp_date.year > p_spo2->year)
				||((temp_date.year == p_spo2->year)&&(temp_date.month > p_spo2->month))
				||((temp_date.year == p_spo2->year)&&(temp_date.month == p_spo2->month)&&(temp_date.day > p_spo2->day))
				)
			{
				if(i < 6)
				{
					p_spo2++;
					if((temp_date.year < p_spo2->year)
						||((temp_date.year == p_spo2->year)&&(temp_date.month < p_spo2->month))
						||((temp_date.year == p_spo2->year)&&(temp_date.month == p_spo2->month)&&(temp_date.day < p_spo2->day))
						)
					{
						break;
					}
				}
			}
		}

		if(i<6)
		{
			//找到位置，插入新数据，老数据整体往后挪，丢掉最后一个
			memcpy(&databuf[0*sizeof(ppg_spo2_rec2_data)], &tmpbuf[0*sizeof(ppg_spo2_rec2_data)], (i+1)*sizeof(ppg_spo2_rec2_data));
			memcpy(&databuf[(i+1)*sizeof(ppg_spo2_rec2_data)], &tmp_spo2, sizeof(ppg_spo2_rec2_data));
			memcpy(&databuf[(i+2)*sizeof(ppg_spo2_rec2_data)], &tmpbuf[(i+1)*sizeof(ppg_spo2_rec2_data)], (7-(i+2))*sizeof(ppg_spo2_rec2_data));
			SpiFlash_Write(databuf, PPG_SPO2_REC2_DATA_ADDR, PPG_SPO2_REC2_DATA_SIZE);
		}
		else
		{
			//未找到位置，直接接在末尾，老数据整体往前移，丢掉最前一个
			memcpy(&databuf[0*sizeof(ppg_spo2_rec2_data)], &tmpbuf[1*sizeof(ppg_spo2_rec2_data)], 6*sizeof(ppg_spo2_rec2_data));
			memcpy(&databuf[6*sizeof(ppg_spo2_rec2_data)], &tmp_spo2, sizeof(ppg_spo2_rec2_data));
			SpiFlash_Write(databuf, PPG_SPO2_REC2_DATA_ADDR, PPG_SPO2_REC2_DATA_SIZE);
		}
	}
}

void GetCurDaySpo2RecData(uint8_t *databuf)
{
	uint8_t i,tmpbuf[PPG_SPO2_REC2_DATA_SIZE] = {0};
	ppg_spo2_rec2_data spo2_rec2 = {0};
	
	if(databuf == NULL)
		return;

	SpiFlash_Read(tmpbuf, PPG_SPO2_REC2_DATA_ADDR, PPG_SPO2_REC2_DATA_SIZE);
	for(i=0;i<7;i++)
	{
		memcpy(&spo2_rec2, &tmpbuf[i*sizeof(ppg_spo2_rec2_data)], sizeof(ppg_spo2_rec2_data));
		if((spo2_rec2.year == 0xffff || spo2_rec2.year == 0x0000)||(spo2_rec2.month == 0xff || spo2_rec2.month == 0x00)||(spo2_rec2.day == 0xff || spo2_rec2.day == 0x00))
			continue;
		
		if((spo2_rec2.year == date_time.year)&&(spo2_rec2.month == date_time.month)&&(spo2_rec2.day == date_time.day))
		{
			memcpy(databuf, spo2_rec2.spo2, sizeof(spo2_rec2.spo2));
			break;
		}
	}
}

void GetGivenTimeSpo2RecData(sys_date_timer_t date, uint8_t *spo2)
{
	uint8_t i,tmpbuf[PPG_SPO2_REC2_DATA_SIZE] = {0};
	ppg_spo2_rec2_data spo2_rec2 = {0};

	if(!CheckSystemDateTimeIsValid(date))
		return;
	if(spo2 == NULL)
		return;

