duxinglang-1/nRF9160_test/E2_V3_PPG_TEST/src/ppg/max32674.c
			if(u32_sampleCnt > 1)
				index = (u32_sampleCnt-1) * num_bytes_to_read + 1;
			else
				index = 1;

			if(1
			#ifdef CONFIG_FACTORY_TEST_SUPPORT
				&& !IsFTPPGTesting()
				&& !IsFTPPGAging()
			#endif
				)
			{
				sensorhub_get_output_scd_state(&databuf[index + SS_PACKET_COUNTERSIZE + SSMAX86176_MODE1_DATASIZE + SSACCEL_MODE1_DATASIZE], &scd_status);
			#ifdef PPG_DEBUG
				LOGD("scd_status:%d", scd_status);
			#endif
				if(!ppg_stop_flag)
				{
					if(scd_status == 3)
						scc_check_sum = SCC_COMPARE_MAX;
					else
						scc_check_sum--;

					count++;
					if(count >= SCC_COMPARE_MAX)
					{
						count = 0;
						if(scc_check_sum != 0)
							ppg_skin_contacted_flag = true;
						else
							ppg_skin_contacted_flag = false;

						scc_check_sum = SCC_COMPARE_MAX;
					#ifdef PPG_DEBUG
						LOGD("scc check completed! scc_check_sum:%d,flag:%d", scc_check_sum,ppg_skin_contacted_flag);
					#endif
						if((g_ppg_trigger&TRIGGER_BY_SCC) != 0)
						{	
							ppg_stop_flag = true;
							return;
						}
						else
						{
							if(!ppg_skin_contacted_flag)
							{
							#ifdef PPG_DEBUG
								LOGD("No Skin Contact - PPG Stopped");
							#endif
								ppg_stop_flag = true;
								if((g_ppg_trigger&TRIGGER_BY_MENU) != 0)
								{
									infor.img[0] = IMG_WRIST_OFF_ICON_ADDR;
									infor.img_count = 1;
									DisplayPopUp(infor);
								}
								return;
							}
						}
					}
				}
			}

			if(g_ppg_alg_mode == ALG_MODE_HR_SPO2)
			{
				if(j > 0)
				{
					heart_rate = heart_rate/j;
					blood_oxy = blood_oxy/j;
				}

			#ifdef PPG_DEBUG
				LOGD("avra hr:%d, spo2:%d", heart_rate, blood_oxy);
			#endif
				if(g_ppg_data == PPG_DATA_HR)
				{
					uint8_t hr = 0;
					
					hr = heart_rate/10 + ((heart_rate%10 > 4) ? 1 : 0);
				#ifdef PPG_DEBUG
					LOGD("hr:%d", hr);
				#endif

					if(hr > PPG_HR_MIN)
					{
					#if 0	//xb test 2023.04.03 Modify the hr measurement data filtering mode. 
						for(i=0;i<sizeof(temp_hr)/sizeof(temp_hr[0]);i++)
						{
							uint8_t k;
							
							if(temp_hr[i] == 0)
							{
								temp_hr[i] = hr;
								break;
							}
							else if(temp_hr[i] >= hr)
							{
								for(k=sizeof(temp_hr)/sizeof(temp_hr[0])-1;k>=i+1;k--)
								{
									temp_hr[k] = temp_hr[k-1];
								}
								temp_hr[i] = hr;
								break;
							}
						}

					#ifdef PPG_DEBUG
						for(i=0;i<sizeof(temp_hr)/sizeof(temp_hr[0]);i++)
						{		
							LOGD("temp_hr:%d", temp_hr[i]);
						}
						LOGD("temp_hr_count:%d", temp_hr_count);
					#endif

						temp_hr_count++;
						if(temp_hr_count >= sizeof(temp_hr)/sizeof(temp_hr[0]))
						{
							uint16_t hr_data = 0;
							
							for(i=PPG_HR_DEL_MIN_NUM;i<temp_hr_count;i++)
							{
								hr_data += temp_hr[i];
							}

							g_hr = hr_data/(temp_hr_count-PPG_HR_DEL_MIN_NUM);
							temp_hr_count = 0;
							
							get_hr_ok_flag = true;
							ppg_stop_flag = true;
						#ifdef PPG_DEBUG
							LOGD("get hr success! hr:%d", g_hr);
						#endif
						}
					#else
						temp_hr_count++;
						if(temp_hr_count >= sizeof(temp_hr)/sizeof(temp_hr[0]))
						{
							temp_hr_count = 0;

							g_hr = hr;
							get_hr_ok_flag = true;
							ppg_stop_flag = true;
						#ifdef PPG_DEBUG
							LOGD("get hr success! hr:%d", g_hr);
						#endif
						}
					#endif
					}
				}
				else if(g_ppg_data == PPG_DATA_SPO2)
				{
					uint8_t spo2 = 0;
					
					spo2 = blood_oxy/10 + ((blood_oxy%10 > 4) ? 1 : 0);
				#ifdef PPG_DEBUG
					LOGD("spo2:%d", spo2);
				#endif
					if(spo2 >= PPG_SPO2_MIN)
					{
						for(i=0;i<sizeof(temp_spo2)/sizeof(temp_spo2[0]);i++)
						{
							uint8_t k;
							
							if(temp_spo2[i] == 0)
							{
								temp_spo2[i] = spo2;
								break;
							}
							else if(temp_spo2[i] >= spo2)
							{
								for(k=sizeof(temp_spo2)/sizeof(temp_spo2[0])-1;k>=i+1;k--)
								{
									temp_spo2[k] = temp_spo2[k-1];
								}
								temp_spo2[i] = spo2;
								break;
							}
						}

					#ifdef PPG_DEBUG
						for(i=0;i<sizeof(temp_spo2)/sizeof(temp_spo2[0]);i++)
						{		
							LOGD("temp_spo2:%d", temp_spo2[i]);
						}
						LOGD("temp_spo2_count:%d", temp_spo2_count);
					#endif

						temp_spo2_count++;
						if(temp_spo2_count >= sizeof(temp_spo2)/sizeof(temp_spo2[0]))
						{
							uint16_t spo2_data = 0;
							
							for(i=PPG_SPO2_DEL_MIN_NUM;i<temp_spo2_count;i++)
							{
								spo2_data += temp_spo2[i];
							}
							
							g_spo2 = spo2_data/(temp_spo2_count-PPG_SPO2_DEL_MIN_NUM);
							temp_spo2_count = 0;

							get_spo2_ok_flag = true;
							ppg_stop_flag = true;
						#ifdef PPG_DEBUG
							LOGD("get spo2 success! spo2:%d", g_spo2);
						#endif
						}
					}
				}
			}
		}
		else
		{
		#ifdef PPG_DEBUG
			LOGD("read FIFO result fail:%d", ret);
		#endif
		}
	}
	else
	{
	#ifdef PPG_DEBUG
		LOGD("FIFO status is not ready:%d,%d", ret, hubStatus);
	#endif
	}

	if((g_ppg_data == PPG_DATA_BPT)&&(screen_id == SCREEN_ID_BP))
	{
		static bool flag = false;
		
		flag = !flag;
		if(flag || get_bpt_ok_flag)
			ppg_redraw_data_flag = true;
	}
	else if((g_ppg_data == PPG_DATA_SPO2)&&(screen_id == SCREEN_ID_SPO2 || screen_id == SCREEN_ID_IDLE))
	{
		ppg_redraw_data_flag = true;
	}
	else if((g_ppg_data == PPG_DATA_HR)&&(screen_id == SCREEN_ID_HR || screen_id == SCREEN_ID_IDLE))
	{
		ppg_redraw_data_flag = true;
	}
}

void ppg_delay_start_timerout(struct k_timer *timer_id)
{
	ppg_delay_start_flag = true;
}

#ifdef CONFIG_FACTORY_TEST_SUPPORT
void FTStartPPG(void)
{
	ft_start_hr = true;
}

void FTStopPPG(void)
{
	ppg_stop_flag = true;
}
#endif

void StartSCC(void)
{
	g_ppg_trigger = TRIGGER_BY_SCC;
	g_ppg_data = PPG_DATA_HR;
	g_ppg_alg_mode = ALG_MODE_HR_SPO2;

	ppg_skin_contacted_flag = true;
    ppg_start_flag = true;
	k_timer_start(&ppg_skin_check_timer, K_SECONDS(10), K_NO_WAIT);
}

bool CheckSCC(void)
{
	return ppg_skin_contacted_flag;
}

void StartPPG(PPG_DATA_TYPE data_type, PPG_TRIGGER_SOURCE trigger_type)
{
	notify_infor infor = {0};

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
#else		
	LCD_SetFontSize(FONT_SIZE_16);
#endif
	infor.x = 0;
	infor.y = 0;
	infor.w = LCD_WIDTH;
	infor.h = LCD_HEIGHT;
	infor.align = NOTIFY_ALIGN_CENTER;
	infor.type = NOTIFY_TYPE_POPUP;

