duxinglang-1/nRF9160_test/E2_V3_PPG_TEST/src/ppg/max32674.c
	switch(trigger_type)
	{
	case TRIGGER_BY_HOURLY:
		if(!is_wearing())
		{
			return;
		}

		if(IsInPPGScreen())
		{
			PPGScreenStopTimer();
			if(PPGIsWorking())
				PPGStopCheck();

			infor.img_count = 0;
			mmi_ucs2cpy(infor.text, (uint8_t*)&str_timing_note[global_settings.language]);
			DisplayPopUp(infor);

			g_ppg_data = data_type;
			k_timer_start(&ppg_delay_start_timer, K_MSEC((NOTIFY_TIMER_INTERVAL+1)*1000), K_NO_WAIT);
			return;
		}
		break;
		
	case TRIGGER_BY_MENU:
		if(!is_wearing())
		{
			infor.img[0] = IMG_WRIST_OFF_ICON_ADDR;
			infor.img_count = 1;
			DisplayPopUp(infor);
			return;
		}

		if(PPGIsWorkingTiming())
		{
			infor.img_count = 0;
			mmi_ucs2cpy(infor.text, (uint8_t*)str_running_note[global_settings.language]);
			DisplayPopUp(infor);
			return;
		}

		switch(data_type)
		{
		case PPG_DATA_HR:
			g_hr_menu = 0;
			break;
		case PPG_DATA_SPO2:
			g_spo2_menu = 0;
			break;
		case PPG_DATA_BPT:
			memset(&g_bpt_menu, 0x00, sizeof(bpt_data));
			break;
		}
		break;

#ifdef CONFIG_BLE_SUPPORT
	case TRIGGER_BY_APP_ONE_KEY:
		if(!is_wearing())
		{
			MCU_send_app_one_key_measure_data();
			return;
		}
		if(PPGIsWorking())
		{
			if(g_ppg_data == PPG_DATA_HR)
				g_ppg_trigger |= trigger_type;
			else
				MCU_send_app_one_key_measure_data();

			return;
		}
		break;
		
	case TRIGGER_BY_APP:
		if(!is_wearing())
		{
			uint8_t hr = 0;
			
			MCU_send_app_get_ppg_data(data_type, &hr);
			return;
		}
		if(PPGIsWorking())
		{
			if(g_ppg_data == PPG_DATA_HR)
				g_ppg_trigger |= trigger_type;
			else
				MCU_send_app_get_ppg_data(data_type, &g_hr);

			return;
		}
		break;
#endif

	case TRIGGER_BY_FT:
		g_ppg_trigger = TRIGGER_BY_FT;
		g_ppg_alg_mode = ALG_MODE_HR_SPO2;
		g_ppg_data = PPG_DATA_HR;
		ppg_start_flag = true;
		return;
		
	default:
		return;
	}

	g_ppg_trigger |= trigger_type;
	g_ppg_data = data_type;
	switch(data_type)
	{
	case PPG_DATA_HR:
		g_ppg_alg_mode = ALG_MODE_HR_SPO2;
		g_hr = 0;
		temp_hr_count = 0;
		memset(&temp_hr, 0x00, sizeof(temp_hr));	
		get_hr_ok_flag = false;
		break;
		
	case PPG_DATA_SPO2:
		g_ppg_alg_mode = ALG_MODE_HR_SPO2;
		g_spo2 = 0;
		temp_spo2_count	= 0;
		memset(&temp_spo2, 0x00, sizeof(temp_spo2));
		get_spo2_ok_flag = false;
		break;
		
	case PPG_DATA_BPT:
		g_ppg_alg_mode = ALG_MODE_BPT;
		memset(&g_bpt, 0, sizeof(bpt_data));
		get_bpt_ok_flag = false;
		break;
	}

	if(trigger_type == TRIGGER_BY_MENU && data_type == PPG_DATA_HR)
		ppg_test_flag = true;
	else
		ppg_start_flag = true;
}

void MenuStartHr(void)
{
	menu_start_hr = true;
}

void MenuStopHr(void)
{
	ppg_stop_flag = true;
}

void MenuStartSpo2(void)
{
	menu_start_spo2 = true;
}

void MenuStopSpo2(void)
{
	ppg_stop_flag = true;
}

void MenuStartBpt(void)
{
	menu_start_bpt = true;
}

void MenuStopBpt(void)
{
	ppg_stop_flag = true;
}

void MenuStartPPG(void)
{
	g_ppg_trigger |= TRIGGER_BY_MENU;
	ppg_start_flag = true;
}

void MenuStopPPG(void)
{
	g_ppg_trigger = 0;
	g_ppg_alg_mode = ALG_MODE_HR_SPO2;
	g_ppg_bpt_status = BPT_STATUS_GET_EST;
	ppg_stop_flag = true;
}

void PPGStartCheck(void)
{
#ifdef PPG_DEBUG
	LOGD("ppg_power_flag:%d", ppg_power_flag);
#endif
	if(ppg_power_flag > 0)
		return;

	if(g_ppg_alg_mode == ALG_MODE_BPT)
		SCC_COMPARE_MAX = 3*PPG_SCC_COUNT_MAX;
	else
		SCC_COMPARE_MAX = PPG_SCC_COUNT_MAX;
	scc_check_sum = SCC_COMPARE_MAX;
	
	PPG_Enable();
	PPG_Power_On();
	PPG_i2c_on();
	
	ppg_power_flag = 1;

	StartSensorhub();
}

void PPGStopCheck(void)
{
	int status = -1;
	bool save_flag = false;
	
#ifdef PPG_DEBUG
	LOGD("ppg_power_flag:%d", ppg_power_flag);
#endif
	k_timer_stop(&ppg_appmode_timer);
	k_timer_stop(&ppg_stop_timer);
	k_timer_stop(&ppg_menu_stop_timer);
	k_timer_stop(&ppg_get_hr_timer);
	k_timer_stop(&ppg_delay_start_timer);
	k_timer_stop(&ppg_bpt_est_start_timer);
	k_timer_stop(&ppg_skin_check_timer);

	sh_stop_polling_timer();

	if(ppg_power_flag == 0)
		return;

	sensorhub_disable_sensor();
	sensorhub_disable_algo();

	PPG_i2c_off();
	PPG_Power_Off();
	PPG_Disable();

	ppg_power_flag = 0;

#ifdef CONFIG_BLE_SUPPORT
	if((g_ppg_trigger&TRIGGER_BY_APP_ONE_KEY) != 0)
	{
		g_ppg_trigger = g_ppg_trigger&(~TRIGGER_BY_APP_ONE_KEY);
		MCU_send_app_one_key_measure_data();
	}
	if((g_ppg_trigger&TRIGGER_BY_APP) != 0)
	{
		g_ppg_trigger = g_ppg_trigger&(~TRIGGER_BY_APP);
		switch(g_ppg_data)
		{
		case PPG_DATA_HR:
			MCU_send_app_get_ppg_data(g_ppg_data, &g_hr);
			break;
		case PPG_DATA_SPO2:
			MCU_send_app_get_ppg_data(g_ppg_data, &g_spo2);
			break;
		case PPG_DATA_BPT:
			MCU_send_app_get_ppg_data(g_ppg_data, (uint8_t*)&g_bpt);
			break;
		}
	}
#endif	
	if((g_ppg_trigger&TRIGGER_BY_MENU) != 0)
	{
		bool flag = false;
		
		g_ppg_trigger = g_ppg_trigger&(~TRIGGER_BY_MENU);
		switch(g_ppg_data)
		{
		case PPG_DATA_HR:
			if(get_hr_ok_flag)
			{
				flag = true;
				g_hr_menu = g_hr;
			#ifdef CONFIG_BLE_SUPPORT	
				if(g_ble_connected)
				{
					MCU_send_app_get_ppg_data(PPG_DATA_HR, &g_hr);
				}
			#endif
			}
			break;
		case PPG_DATA_SPO2:
			if(get_spo2_ok_flag)
			{
				flag = true;
				g_spo2_menu = g_spo2;
			#ifdef CONFIG_BLE_SUPPORT	
				if(g_ble_connected)
				{
					MCU_send_app_get_ppg_data(PPG_DATA_SPO2, &g_spo2);
				}
			#endif
			}
			break;
		case PPG_DATA_BPT:
			if(get_bpt_ok_flag)
			{
				if(g_ppg_bpt_status == BPT_STATUS_GET_EST)
				{
					flag = true;
					memcpy(&g_bpt_menu, &g_bpt, sizeof(bpt_data));
				#ifdef CONFIG_BLE_SUPPORT	
					if(g_ble_connected)
					{
						MCU_send_app_get_ppg_data(PPG_DATA_BPT, (uint8_t*)&g_bpt);
					}
				#endif	
				}
			}
			break;
		}

		if(flag)
		{
			SyncSendHealthData();
			g_hr_menu = 0;
			g_spo2_menu = 0;
			memset(&g_bpt_menu, 0x00, sizeof(bpt_data));
		}
	}
	if((g_ppg_trigger&TRIGGER_BY_HOURLY) != 0)
	{
		uint8_t tmp_hr,tmp_spo2;
		bpt_data tmp_bpt;
		
		g_ppg_trigger = g_ppg_trigger&(~TRIGGER_BY_HOURLY);
		switch(g_ppg_data)
		{
		case PPG_DATA_HR:
			tmp_hr = g_hr;
			if(!ppg_skin_contacted_flag)
				tmp_hr = 0xFE;
			SetCurDayHrRecData(tmp_hr);
			break;
		case PPG_DATA_SPO2:
			tmp_spo2 = g_spo2;
			if(!ppg_skin_contacted_flag)
				tmp_spo2 = 0xFE;
			SetCurDaySpo2RecData(tmp_spo2);
			break;
		case PPG_DATA_BPT:
			memcpy(&tmp_bpt, &g_bpt, sizeof(bpt_data));
			if(!ppg_skin_contacted_flag)
				memset(&tmp_bpt, 0xFE, sizeof(bpt_data));
			SetCurDayBptRecData(tmp_bpt);
			break;
		}
	}

