duxinglang-1/nRF9160_test/E2_V3_PPG_TEST/src/ppg/max32674.c
	if((g_ppg_trigger&TRIGGER_BY_SCC) != 0)
	{
		g_ppg_trigger = g_ppg_trigger&(~TRIGGER_BY_SCC);
	}

#ifdef CONFIG_FACTORY_TEST_SUPPORT
	if((g_ppg_trigger&TRIGGER_BY_FT) != 0)
	{
		FTPPGStatusUpdate(0, 0);
		return;
	}
#endif

	if(g_ppg_alg_mode == ALG_MODE_HR_SPO2)
	{
		if((g_ppg_data == PPG_DATA_HR)&&(g_hr > 0))
		{
			last_health.hr_rec.timestamp.year = date_time.year;
			last_health.hr_rec.timestamp.month = date_time.month; 
			last_health.hr_rec.timestamp.day = date_time.day;
			last_health.hr_rec.timestamp.hour = date_time.hour;
			last_health.hr_rec.timestamp.minute = date_time.minute;
			last_health.hr_rec.timestamp.second = date_time.second;
			last_health.hr_rec.timestamp.week = date_time.week;
			last_health.hr_rec.hr = g_hr;
			save_flag = true;
		}
		else if((g_ppg_data == PPG_DATA_SPO2)&&(g_spo2 > 0))
		{
			last_health.spo2_rec.timestamp.year = date_time.year;
			last_health.spo2_rec.timestamp.month = date_time.month; 
			last_health.spo2_rec.timestamp.day = date_time.day;
			last_health.spo2_rec.timestamp.hour = date_time.hour;
			last_health.spo2_rec.timestamp.minute = date_time.minute;
			last_health.spo2_rec.timestamp.second = date_time.second;
			last_health.spo2_rec.timestamp.week = date_time.week;
			last_health.spo2_rec.spo2 = g_spo2;
			save_flag = true;
		}
	}
	else if((g_ppg_alg_mode == ALG_MODE_BPT)&&(g_ppg_bpt_status == BPT_STATUS_GET_EST))
	{
		if((g_bpt.systolic > 0)&&(g_bpt.diastolic > 0))
		{
			last_health.bpt_rec.timestamp.year = date_time.year;
			last_health.bpt_rec.timestamp.month = date_time.month; 
			last_health.bpt_rec.timestamp.day = date_time.day;
			last_health.bpt_rec.timestamp.hour = date_time.hour;
			last_health.bpt_rec.timestamp.minute = date_time.minute;
			last_health.bpt_rec.timestamp.second = date_time.second;
			last_health.bpt_rec.timestamp.week = date_time.week;
			last_health.bpt_rec.systolic = g_bpt.systolic;
			last_health.bpt_rec.diastolic = g_bpt.diastolic;
			save_flag = true;
		}
	}

	if(save_flag)
	{
		save_cur_health_to_record(&last_health);
	}
}

void PPGStopBptCal(void)
{
	k_timer_stop(&ppg_get_hr_timer);
	
	sensorhub_disable_sensor();
	sensorhub_disable_algo();

	PPG_i2c_off();
	PPG_Power_Off();
	PPG_Disable();

	ppg_power_flag = 0;
}

static void ppg_auto_stop_timerout(struct k_timer *timer_id)
{
	ppg_stop_flag = true;
}

static void ppg_skin_check_timerout(struct k_timer *timer_id)
{
	ppg_stop_flag = true;
}

static void ppg_menu_stop_timerout(struct k_timer *timer_id)
{
	ppg_stop_flag = true;
	
	if((screen_id == SCREEN_ID_HR)
		||(screen_id == SCREEN_ID_SPO2)
		||(screen_id == SCREEN_ID_BP)
		)
	{
		g_ppg_status = PPG_STATUS_MEASURE_FAIL;

		if(screen_id == SCREEN_ID_HR)
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_HR;
		else if(screen_id == SCREEN_ID_SPO2)
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_SPO2;
		else if(screen_id == SCREEN_ID_BP)
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_BP;
		
		scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
	}
}

void ppg_polling_timerout(struct k_timer *timer_id)
{
	ppg_polling_timeout_flag = true;
}

void sh_stop_polling_timer(void)
{
	k_timer_stop(&ppg_polling_timer);
}

void sh_start_polling_timer(uint32_t delay_ms)
{
	k_timer_start(&ppg_polling_timer, K_MSEC(delay_ms), K_MSEC(delay_ms));	
}

void PPGStartRawData(void)
{
	bool ret = false;

#ifdef PPG_DEBUG
	LOGD("ppg_power_flag:%d", ppg_power_flag);
#endif
	if(ppg_power_flag > 0)
		return;

	PPG_Enable();
	k_sleep(K_MSEC(10));
	PPG_Power_On();
	PPG_i2c_on();

	ppg_power_flag = 1;

	SH_rst_to_APP_mode();

	//sh_start_rawdata_mode(&sh_ctrl_rawdata_param);
	sh_start_HR_SPO2_mode(&sh_ctrl_HR_SPO2_param);
}

void PPG_init(void)
{
#ifdef PPG_DEBUG
	LOGD("PPG_init");
#endif

	//Display the last record within 7 days.
	get_cur_health_from_record(&last_health);
	DateIncrease(&last_health.hr_rec.timestamp, 7);
	if(DateCompare(last_health.hr_rec.timestamp, date_time) > 0)
	{
		g_hr = last_health.hr_rec.hr;
	}

	DateIncrease(&last_health.spo2_rec.timestamp, 7);
	if(DateCompare(last_health.spo2_rec.timestamp, date_time) > 0)
	{
		g_spo2 = last_health.spo2_rec.spo2;
	}

	DateIncrease(&last_health.bpt_rec.timestamp, 7);
	if(DateCompare(last_health.bpt_rec.timestamp, date_time) > 0)
	{
		g_bpt.systolic = last_health.bpt_rec.systolic;
		g_bpt.diastolic = last_health.bpt_rec.diastolic;
	}

	if(!sh_init_interface())
		return;

#ifdef PPG_DEBUG	
	LOGD("PPG_init done!");
#endif
}

void PPGMsgProcess(void)
{
	if(ppg_int_event)
	{
		ppg_int_event = false;
	}
	
	if(ppg_fw_upgrade_flag)
	{
		SH_OTA_upgrade_process();
		ppg_fw_upgrade_flag = false;
	}

#ifdef CONFIG_FACTORY_TEST_SUPPORT
	if(ft_start_hr)
	{
		StartPPG(PPG_DATA_HR, TRIGGER_BY_FT);
		ft_start_hr = false;
	}
#endif

	if(menu_start_hr)
	{
		StartPPG(PPG_DATA_HR, TRIGGER_BY_MENU);
		menu_start_hr = false;
	}
	
	if(menu_start_spo2)
	{
		StartPPG(PPG_DATA_SPO2, TRIGGER_BY_MENU);
		menu_start_spo2 = false;
	}
	
	if(menu_start_bpt)
	{
		StartPPG(PPG_DATA_BPT, TRIGGER_BY_MENU);
		menu_start_bpt = false;
	}
	
	if(ppg_start_flag)
	{
	#ifdef PPG_DEBUG
		LOGD("PPG start!");
	#endif
		PPGStartCheck();
		ppg_start_flag = false;
	}

	if(ppg_test_flag)
	{
	#ifdef PPG_DEBUG
		LOGD("PPG test start!");
	#endif
		PPGStartRawData();
		ppg_test_flag = false;
	}
	
	if(ppg_stop_flag)
	{
	#ifdef PPG_DEBUG
		LOGD("PPG stop!");
	#endif
		PPGStopCheck();
		ppg_stop_flag = false;
	}

	if(ppg_stop_cal_flag)
	{
	#ifdef PPG_DEBUG	
		LOGD("bpt cal stop");
	#endif
		PPGStopBptCal();
		ppg_stop_cal_flag = false;
	}
	
	if(ppg_get_cal_flag)
	{
		ppg_get_cal_flag = false;
	}
	
	if(ppg_get_data_flag)
	{
		PPGGetSensorHubData();
		ppg_get_data_flag = false;
	}
	
	if(ppg_redraw_data_flag)
	{
		PPGRedrawData();
		ppg_redraw_data_flag = false;
	}

	if(ppg_delay_start_flag)
	{
		switch(g_ppg_data)
		{
		case PPG_DATA_HR:
			StartPPG(PPG_DATA_HR, TRIGGER_BY_HOURLY);
			break;

		case PPG_DATA_SPO2:
			StartPPG(PPG_DATA_SPO2, TRIGGER_BY_HOURLY);
			break;

		case PPG_DATA_BPT:
			StartPPG(PPG_DATA_BPT, TRIGGER_BY_HOURLY);
			break;
		}

		ppg_delay_start_flag = false;
	}

	if(ppg_appmode_init_flag)
	{
		StartSensorhubCallBack();
		ppg_appmode_init_flag = false;
	}

	if(ppg_polling_timeout_flag)
	{
		sh_FIFO_polling_handler();
		ppg_polling_timeout_flag = false;
	}
}

